# RL - unit 0 

## 강화학습 이란?

강화학습이란 에이전트가 환경과 상호 작용하여 최적의 정책을 얻는 것을 말한다. 에이전트가 환경에서 액션을 취할 때마다 보상과 상태를 업데이트하여 
그 정보를 기반으로 주어진 문제를 해결하는 최적의 정책을 발견하는 일련의 과정을 강화학습이라고 칭한다.

### 환경

환경은 에이전트가 상호작용하는 모든 객체와 공간을 말한다. 체스를 예로 들면, 체스판 위에 올라와 있는 모든 말과 체스판을 환경이라고 할 수 있다.

### 에이전트

에이전트는 환경 속에서 학습을 하는 주체를 의미한다. 체스를 예로 들면 체스를 두는 사람 혹은 봇이라고 할 수 있다.

### 상태

상태는 에이전트가 환경과 상호작용하며 변화환 환경과 보상을 의미한다. 즉, 에이전트가 환경과 상호작용하며 얻는 정보를 의미한다. 
엄밀하게 구분하면 상태와 관측으로 다시 나뉠 수 있다.

* 상태 : 상태는 에이전트가 환경과 상호작용하며 변화한 환경 전체에 대한 설명이다.
  * eg) : 말을 움직였을 떄 체스판 전체에 대한 상태
* 관측 : 관측은 에이전트가 환경과 상호작용하며 얻어낸 환경의 일부에 대한 설명이다.
  * eg) 마리오 게임에서 마리오를 움직였을 떄, 얻는 게임 내의 프레임 안에 있는 정보.

### 액션

액션은 에이전트가 환경과 상호작용할 수 있는 방식의 총체라고 할 수 있다.
체스를 예로 들자면, 말을 선택하는 것과 말을 움직이는 것 등등이 있을 수 있을 것 이다. 
액션의 유형에는 두 가지가 있다. 

1) 이산적인 유형
  - 이산적인 유형은 액션이 유한한 것을 의미한다.
2) 연속적인 유형 
  - 연속적인 유형은 액션이 무한한 것을 의미한다.

### 보상과 할인율

보상이란 강화학습에서 매우 중요하다. 그 이유는 보상이 에이전트가 액션을 통해 얻는 유일한 피드백이기 때문이다. 
보상을 통해서 에이전트는 특정 상태에서 취한 액션이 좋은 것인지 나쁜 것인지 알 수 있기 때문이다.

앞서서, 강화학습이란 에이전트가 최적의 정책을 얻는 일련의 과정이라고 하였다. '최적의 정책'의 정확한 의미는 무엇일까? 최적 정책이 의미하는 바는 에이전트가 상호작용하며
얻어낸 기대 보상의 합을 극대화하는 것을 의미한다. 이를 수식으로 나타내면 아래와 같다.

```math
$\sum$
```


